[
    {
    "date": "сборка 0.8.6 [22.03.2024]",
    "description": "- Значительное усовершенствование Андромеды, теперь она понимает больше слов, у нее есть своя страница с Инструкцией. - Интеграция сайта Посылов с КОСМ Календарем."
    },
    {
    "date": "сборка 0.8.5 [21.03.2024]",
    "description": "- Добавлена кнопка бутерброда, при нажатии открывает меню с суб-кнопками, ведущими на наши основные интернет ресурсы."
    },
    {
    "date": "сборка 0.8.4 [13.03.2024]",
    "description": "- Андромеда обрела живой голос, стала воспринимать значительно больше предложений: \"Покажи Академию, Доктрину, Катрены. Покажи сегодняшний катрен, вчерашний катрен\". Во время первого запуска Она приветствует. - При просмотре со смартфона доработан альбомный режим. Сильно изменен дизайн сайта при просмотре с компьютера, для большего удобства фокусировки на Мыслеобразе."
    },
    {
    "date": "сборка 0.8.0 [10.03.2024]",
    "description": "- Кнопка \"Версии Проекта\" отображается теперь только в режиме Администратора. - Добавлена иконка сайта, ее видит браузер. - Интегрирован голосовой помощник Андромеда, в процессе тестирования. - Громкость звука колокола значительно уменьшена."
    },
    {
    "date": "сборка 0.7.8 [07.03.2024]",
    "description": "- В панель \"Управление\" добавлены 2 кнопки для ускоренного взаимодействия с табличными файлами."
    },
    {
      "date": "сборка 0.7.7 [06.03.2024]",
      "description": "- Множество исправлений. - Музыка Болеро переподгружена в Проект, файл с более высоким качеством. - Запущена система браузерных уведомлений, работает на данный момент только в Windows. Оповещает за 5 минут и менее до начала подготовки к Посылу. - Расширение режима Администратора: новая панель \"Управление\", позволяющая настраивать содержимое сайта и смотреть аналитику."
    },
    {
      "date": "сборка 0.7.2 [04.03.2024]",
      "description": "- Добавлена кнопка с \"Историей изменений\" в левый-верхний угол сайта. - При нажатии на кнопку \"Истории изменений\" откроется окно с этой историей, его можно вертикально прокручивать. Описание окна пока в черновом варианте. - Исправление поведения кнопки \"Открытия таблицы\", теперь кнопка блокируется вне Посылов, но становится доступна за 5 минут до подготовки к Посылу. - Счетчик посещений теперь не является кликабельной ссылкой."
    },
    {
      "date": "сборка 0.7.0 [03.03.2024]",
      "description": "- Подключена Яндекс метрика. - Добавлен счетчик посещений сайта. Данные в нем обновляются автоматически. - Счетчик сам скрывается во время Посыла."
    },
    {
      "date": "сборка 0.6.8 [02.03.2024]",
      "description": "- Доработан режим Администратора. - Можно выходить из \"Админ-режима\" через кнопку."
    },
    {
      "date": "сборка 0.6.1 [29.02.2024]",
      "description": "- Добавлен режим Администратора. - Авторизация для полного доступа, через поле ввода. - Панель управления в режиме Администратора. - Возвращена возможность обновлять страницу методом тапа вниз сверху сайта (на смартфоне). - Раньше одна картинка не всегда прогружалась и был черный экран, такого больше не должно быть. - В начале первого интервала (Покаяние и Молитва) не играл колокол, исправлено. - Распределение: теперь отдельная музыка играет во время Посыла, отдельная на внепосыльное время. - Полоса прокрутки скрывается и блокируется в блоке с текстом Посыла, если открыта Таблица."
    },
    {
      "date": "сборка 0.6.0 [28.02.2024]",
      "description": "- Реализована вертикальная прокрутка в Таблице. Размеры Таблицы стали более адаптивные. - На страницу добавлена кнопка \"Версия для печати\", при нажатии переводит пользователя на другой сайт, где можно распечатать текст Посыла в привычном виде. Кнопка доступна только при разблокированной таблице. - В проект загружена музыка Болеро, играет при любых сценариях. - Значительно улучшена точность времени, отображаемого на сайте, благодаря API."
    },
    {
      "date": "сборка 0.5.7 [27.02.2024]",
      "description": "- Добавлена система браузерных уведомлений, пока работает в тестовом режиме."
    },
    {
      "date": "сборка 0.5.4 [26.02.2024]",
      "description": "- На странице появилась новая кнопка \"Вызова Таблицы\", при нажатии на нее открывается Таблица со всеми текстами Посыла, плюс Покаяния и Молитвы. Полезна при Часовом Посыле. - При наведении курсором на включенную кнопку музыки можно будет увидеть вверху сайта бегущую строку с названием песни и ее исполнителем."
    },
    {
      "date": "сборка 0.5.2 [25.02.2024]",
      "description": "- Теперь можно вертикально прокручивать блок, внутри которого находится время и текст Посыла."
    },
    {
      "date": "сборка 0.4.9 [21.02.2024]",
      "description": "- Текст Посыла перемещен из JS-кода в отдельные табличные файлы, которые можно переподгружать в Проект."
    },
    {
      "date": "сборка 0.4.5 [20.02.2024]",
      "description": "- Включено отображение рандомного блока с четверостишьем, при нажатии на него пользователь перейдет на сайт Катренов в соответствующий катрен. Блок скрывается во время Посыла. - Во время подготовки к Посылу и при Посыле отображается Мыслеобраз. Вне его идут случайные картинки космоса. - Пока открыт сайт в браузере смартфона, то идет запрет на авто-отключение экрана."
    },
    {
      "date": "сборка 0.1.0 [до 20.02.2024]",
      "description": "- Заложена основа сайта, логика. - Принцип: Когда идет Посыл, то отображается его текст в соответствии с временными интервалами. В остальное время показывается, сколько осталось до следующего Посыла. - Добавлено множество изображений космоса и музыки."
    }
  ]
  
  
  